[
  {
    "academic_number": "239147560001",
    "password": "DreamNasaBionocular",
    "name": "AKSHAYA J",
    "message": "Hey Akshaya,\n\nI still remember some memories from the beginning, even though we didn't talk much. I won't forget the random 'Amma' character.\n\nI think you have a lot of skills and curiosity. But I want to tell you something: there will come a time when many people leave you, or perhaps you'll become silent – that's when you know you're moving towards your career. I chased after research papers extensively, lost a lot, slept during class, lost contact with many, and lost many friendships because of it.\n\nI know you're facing something similar; I've noticed you've become quiet lately. Do everything – papers, research – but try not to take away the curiosity from others. Also, don't be overly curious about everything; too much of anything is dangerous, either to us or someone else.\n\nI remember a specific event when we went to the lab. You were the one mostly using the slit lamp, which is good. But there are many people who don't know how to use it, like Thiru and Rekha. You have the capacity to teach them. Try teaching others first. Don't just share notes or study materials; call them over and teach them. It will help you remember and understand things better too.\n\nYou conduct good seminars, but they can be a bit boring. Try to make them slightly more interactive. Prepare before class and teach in a way that others understand, using simple terms.\n\nI was curious about doing a paper with you, but I heard something and stopped pursuing it.\n\nI don't know if you'll go to NASA in the future, but at least try to go abroad! Try to do a Masters degree because you have the curiosity for it.",
    "message_status": "Written"
  },
  {
    "academic_number": "239147560002",
    "password": "student002",
    "name": "AMRITHA. R",
    "message": "Hi AMRITHA. R!\nYour journey in **optics** has been incredible to watch. Remember when you:\n- First mastered lens calculations\n- Helped organize the department event\n- Won the quiz competition\n> 'The eye sees only what the mind is prepared to comprehend' - Robertson Davies\nKeep that wonderful energy! ",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560003",
    "password": "password003",
    "name": "BHADRA. K. S",
    "message": "Dear BHADRA. K. S;\nYour growth mindset is inspiring! Remember:\n1. You've come so far from where you started\n2. Your research presentation was excellent\n3. The way you help others is admirable\n> Success is not final; failure is not fatal: it is the courage to continue that counts.\nLooking forward to seeing your future achievements! ",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560004",
    "password": "Brotogoodbye",
    "name": "DEEPA SRI",
    "message": "# What I Never Got to Say\n\n**Deepa,**  \nThis isn't written out of anger. It's written because I've carried too much inside without ever explaining it fully. And now that everything is over, I just want to let it out.\n\n---\n\n## From Small Moments to Big Distance\n\nIt all started with something as small as a cake-cutting during academics. I didn't think much of it back then. But after that, I was never chosen as a representative again. Looking back, I wish I never was. I still remember the call fight we had. So much followed because of that one clash. Something you did brought me unexpected trouble—and it didn't stop there.\n\n> \"It's strange how some of the smallest things become the start of everything else.\"\n\n---\n\n## From Friendship to Silence\n\nBecause of the Mega event, we became friends. Over time, I got attached to you unknowingly. We had that 'bro' nickname and our bond was something I believed in. But later, you made me feel like I didn't matter. I used to think you genuinely cared about unity—but then I realized that if Mega didn't speak to you, you didn't speak to me either.\n\nI wasn't like that. I truly thought I had hurt you, and that's why I kept asking again and again. But instead of answers, I got silence. You avoided me for what felt like a silly reason.\n\nWhen Kayal left, I thought maybe things between you, Palani, and Mega would go back to how they were. But everything changed. I never expected such a huge shift.\n\n---\n\n## About the TC – Here's What Actually Happened\n\nSomeone told sir that I was **drunk in the room**. But instead of sir coming to me directly, **he told you**. Then **you told others**, and eventually **it reached me**.\n\nSo I asked you directly, \"Who told you?\" And you replied, \"**Vidhya sir**.\"\n\nI couldn't understand why he would talk about me to someone else rather than me. So I asked the boys, \"**Who told sir that I was drunk in the room?**\" I was tense, but I just wanted to know the truth. I wasn't even sure how it reached sir. I didn't say anything to him, and I wasn't the one who admitted anything.\n\nWhen I asked the boys again, \"**Who told sir about me being drunk?**\" they tried to cover it up, saying, \"No, no, we didn't say anything,\" and deflected, claiming juniors might've told him.\n\nBut deep inside, I knew—**this time, it wasn't outsiders. It was someone from our own class**.\n\nThat's what broke me.\n\n---\n\n## Why I Never Came to Ooty Trip\n\nHere's something I never said before: **I knew it was the boys who told sir about me drinking**. That's why I didn't want to come on the Ooty trip. I had drunk **before the trip**, but I had still planned to join. But once I found out the truth—**that they spoke behind my back**—I couldn't make myself go anymore.\n\nI didn't ask anyone about it. I stayed silent. But one day, this rumor reached you—and the way you handled it? **That's what made me truly angry.**\n\n> \"Betrayal doesn't come from enemies—it comes from those you trust.\"\n\n---\n\n## I Chose the TC Myself\n\nYes, I'm the one who told sir, \"I'll take the TC.\" He said he couldn't help anymore, and I said it's okay—**\"I'll take it myself.\"** That wasn't weakness. That was clarity. I didn't want to stay there anymore.\n\nI told myself:  \n> \"At least I'm escaping this place.\"\n\nAnd I meant it. I don't want to look back or see anyone again—not because I hate anyone, but because I've reached my limit.\n\n---\n\n## What Hurt Me Most\n\nNo one ever asked how I was doing. Not even that day when I was spiraling. Only my mom knew. Mega somehow understood too. But you? My personal life became gossip. Sir had no right to speak about me like that. And neither did you. Maybe you didn't mean harm. Maybe it was casual for you. But for me, it was everything.\n\n> \"Sometimes what's casual for others is a breakdown for someone else.\"\n\n---\n\n## Now It's Over\n\nI'm not writing this for pity or apology. I'm writing this because I needed to say it at least once.  \nYou did what you did.  \nI walked away by choice.\n\nNow I don't want to see anyone again—not out of anger, but peace. I've been hurt enough. I've changed enough. I don't need explanations anymore.\n\n**Goodbye.**",
    "message_status": "Written"
  },
  {
    "academic_number": "239147560005",
    "password": "password005",
    "name": "DHARSHINI.C.S",
    "message": "Hi DHARSHINI.C.S;\nWhat an amazing journey it's been! Proud of your:\n1. **Research contributions**\n2. *Clinical skills*\n3. Team spirit\n> Excellence is not a skill. It's an attitude.\nThe future is bright for you! ",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560006",
    "password": "Tom&Jerrydiedlongago",
    "name": "GOPIKA.P",
    "message": "# Dear Gopika,\n\nI never thought I'd write this. Usually, I don't even read the feedback diaries I give to others. But for you, I felt like I had to. Because you changed my life in two very big ways. First, you gave me some of the happiest memories. Second, you gave me one of the deepest wounds. After you, I stopped making new friends.\n\nAt the start, you made me feel special. You took care of me like no one else ever did. I always felt like no one truly cared, even in my own family. You knew some parts of my life, but not everything. I hid a lot. I even lied sometimes—not because I didn't trust you, but because I didn't want to seem weak. I had already faced too much judgment in school. Even my suicidal thoughts felt lighter after becoming your friend.\n\n> *\"You don't meet people by accident. There's always a reason—a lesson, a blessing, or both.\"*\n\nI didn't choose you. You chose me. And you showed me what a best friend feels like. You used to say we are opposites, but actually, we're not. I used to talk a lot in school, just like you. I was broken after school, and only with you, I started showing my true self again.\n\nI still remember how you made me feel like I mattered. You said things like, *\"I feel safe and happy to have a friend like you,\"* and *\"I don't like giving handshakes to others, but with you, it feels okay.\"* Those words stayed in my heart. You made me feel like a real friend, a brother. You made me feel human again.\n\nBut everything started changing. We fought because I felt like you were slipping away. That day in the third-year hall, you asked me to sit, but you didn't talk. You were with your friends, and I felt alone. Then you called Sanjay, and both of you spoke happily. I was there but felt invisible. When I left, you asked why I was going to Mega. That's when the fights really started.\n\nEvery time I tried to explain my feelings, I got misunderstood. In your diary, you mentioned \"misunderstandings,\" but you never really tried to understand mine. Your friends told me you called me \"toxic.\" That I was the reason you stopped talking to new people. But I never explained myself back then—because if you couldn't understand me when we were close, what's the point now?\n\n> *\"There's nothing more painful than being misunderstood by the one person who you thought would never hurt you.\"*\n\nDo you know why I cut my hands? It wasn't for drama. It was because I couldn't take the pain of being judged and pushed away by the person I trusted the most. You said I was \"torturing\" you. That word shattered me.\n\nEven when I accidentally looked your way or said your name, I stopped myself. I didn't want you to feel uncomfortable. But inside, it hurt every time.\n\nYou remember Hari, right? He sent those messages about me and insulted me. That broke me. Because you knew how things were between you and him. But still, you didn't stop him. You let him judge me while I kept your secrets safe. I don't know if you kept mine—but I hope you did.\n\nAnd even when Hari became your love, not just your friend, I didn't cross any line. I never stopped you from being friends with anyone. But still, you told others that I was controlling. That I gave you boundaries. That I was the problem. I wish you'd read our old messages once again. You'll see who really cared and who didn't.\n\n> *\"You broke me so gently, that I didn't even realize I was bleeding.\"*\n\nI never told anyone your secrets. Even after everything, I protected your image. I never tried to damage your name. But you did that to me.\n\nI wrote long messages. I waited for replies that never came. In the end, I gave up—not because I moved on, but because I couldn't take the pain anymore.\n\nEven now, one of the reels I saved still says \"Best Friend\" with your name. I never removed it. Because a part of me still couldn't accept that it was all over.\n\nOur first birthday celebration didn't bring us closer. It actually made us distant. That was the turning point. On my birthday, I didn't wait for your message. In fact, I hoped you wouldn't send one. Because if you did, I would have replied, and the loop would begin again.\n\n> *\"Sometimes, not hearing from someone hurts less than hearing from them like nothing ever happened.\"*\n\nEven though we took a photo on your birthday, and I tried to call you later—I cut the call and blocked you. Not out of ego. But because I didn't want to ruin your peace. I tried to give space. I tried to heal alone.\n\nYou moved on. But I'm still stuck.\n\nYou once drew that Tom & Jerry paper for me. Back then, I thought it was beautiful. Now I feel like that cartoon was more real than us. Because Tom and Jerry always understood each other, even when they fought. They never let others talk badly about each other. I wish you never drew that for me—because it feels like a broken promise now.\n\n> *\"You meant more to me than I ever meant to you. And that's what hurt the most.\"*\n\n## Final message to you:\n\n- Don't make someone feel special if you're not ready to treat them that way.  \n- Don't judge someone when you haven't tried to see the pain they're hiding.  \n- Don't forget the people who stood by you when no one else did.  \n\nYou once said you cried because I avoided you. But do you know how many nights I cried after losing you?\n\nI didn't leave because of ego. I left because I was tired of feeling like a mistake.\n\n---\n\n**I don't expect a reply. I'm not writing this to get attention. I'm writing this because I want to let go of the weight I've been carrying silently for two years.**\n\nMaybe one day you'll understand everything.\n\nMaybe not.\n\nBut even if I leave this college without a single friend, I'll still remember that for a short time… I had one. And her name was Gopika.\n\n**Goodbye. Take care of yourself. Always.**",
    "message_status": "Written"
  },
  {
    "academic_number": "239147560007",
    "password": "password007",
    "name": "HARISH RAJ.V",
    "message": "Harish Raj, your energy is contagious! Keep up the great work.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560008",
    "password": "password008",
    "name": "JANARTHAN.V",
    "message": "Janarthan, your perseverance is inspiring. Remember how far you've come!",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560009",
    "password": "password009",
    "name": "JEEVARATHINAM",
    "message": "Jeevarathinam, your quiet strength is a valuable asset to the class.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560010",
    "password": "password010",
    "name": "KAVIYA.J",
    "message": "Kaviya, your thoughtful insights always add depth to discussions.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560011",
    "password": "password011",
    "name": "KAYALVIZHI.P",
    "message": "Kayalvizhi, keep sharing your bright ideas with us!",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560012",
    "password": "password012",
    "name": "L.S.KEERTHANA",
    "message": "Keerthana, your dedication is truly commendable.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560013",
    "password": "password013",
    "name": "KEERTHANA SRI.A",
    "message": "Keerthana Sri, your enthusiasm lights up the room.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560014",
    "password": "password014",
    "name": "MANIBHARATHI.V",
    "message": "Manibharathi, keep exploring new concepts with that curious mind!",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560015",
    "password": "password015",
    "name": "MANJU.K",
    "message": "Manju, your calm presence is appreciated by everyone.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560016",
    "password": "password016",
    "name": "MEGA DHARSHINI M",
    "message": "Mega Dharshini, your resilience is truly inspiring.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560017",
    "password": "password017",
    "name": "MOHAMED FARSHIN",
    "message": "Mohamed Farshin, your contributions have made a real difference.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560018",
    "password": "password018",
    "name": "NANDHANA.R",
    "message": "Nandhana, keep pursuing your goals with such determination.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560019",
    "password": "password019",
    "name": "NAVEEN KUMAR R",
    "message": "Naveen Kumar, your hard work does not go unnoticed.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560020",
    "password": "password020",
    "name": "PALANISAMY.K",
    "message": "Palanisamy, your positive attitude is a boost to everyone around you.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560021",
    "password": "password021",
    "name": "REKHA.S",
    "message": "Rekha, keep shining brightly with your unique talents.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560022",
    "password": "password022",
    "name": "SAKTHI PRIYA.B",
    "message": "Sakthi Priya, your strength and grace are admirable.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560023",
    "password": "password023",
    "name": "SALMAN FARISH.M",
    "message": "Salman Farish, keep pushing boundaries and exploring new ideas.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560024",
    "password": "password024",
    "name": "SANJAY K",
    "message": "Sanjay, your thoughtful approach to learning is inspiring.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560025",
    "password": "password025",
    "name": "SHOBANA PRIYA.S",
    "message": "Shobana Priya, your dedication to your studies is clear.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560026",
    "password": "password026",
    "name": "SIVAKAVITHA",
    "message": "Sivakavitha, keep bringing your positive energy to the class.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560027",
    "password": "password027",
    "name": "SREESANDHIYA.G",
    "message": "Sreesandhiya, your quiet persistence is commendable.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560028",
    "password": "password028",
    "name": "THIRUMALAIYAMMAL.K",
    "message": "Thirumalaiyammal, keep exploring and learning with curiosity.",
    "message_status": "Not Written"
  },
  {
    "academic_number": "239147560029",
    "password": "password029",
    "name": "VANISRI.R",
    "message": "Vanisri, your thoughtful nature adds value to our community.",
    "message_status": "Not Written"
  }
]